benchmarks/phase12_results.txt
Running 30s test @ http://localhost:8080
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.48ms   36.45ms   1.30s    94.44%
    Req/Sec    43.51k    12.16k   64.63k    65.27%
  Latency Distribution
     50%   24.90ms
     75%   28.83ms
     90%   37.36ms
     99%  196.25ms
  5180599 requests in 30.07s, 533.59MB read
Requests/sec: 172298.34
Transfer/sec:     17.75MB