benchmarks/phase1_results.txt
Running 10s test @ http://localhost:8080 
  4 threads and 100 connections 
  Thread Stats Avg Stdev Max +/- Stdev
    Latency 1.24ms 14.89ms 335.18ms 99.17%
    Req/Sec 9.53k 5.03k 25.07k 65.01%
  331027 requests in 10.08s, 26.52MB read
  Socket errors: connect 18, read 331027, write 0, timeout 0 
Requests/sec: 32838.68 
Transfer/sec: 2.63MB