benchmarks/phase3_results.txt
Running 10s test @ http://localhost:8080
  4 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.16ms   11.50ms 342.00ms   95.60%
    Req/Sec     4.18k     3.21k   13.54k    74.49%
  165219 requests in 10.09s, 13.24MB read
  Socket errors: connect 100, read 165219, write 0, timeout 0
Requests/sec:  16370.55
Transfer/sec:      1.31MB