benchmarks/phase4_results.txt
Running 10s test @ http://localhost:8080
  4 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.24ms    9.61ms 358.80ms   95.80%
    Req/Sec     6.22k     3.83k   14.73k    52.08%
  240380 requests in 10.10s, 19.26MB read
  Socket errors: connect 330, read 240380, write 0, timeout 0
Requests/sec:  23798.90
Transfer/sec:      1.91MB